In [2]:
import pandas as pd
emp=pd.read_csv("sample.csv")
print(emp)

    Name  Age  Marks
0      V   18     20
1     JK   19     21
2     JM   20     22
3     RM   21     23
4   SUGA   22     24
5    JIN   23     25
6  JHOPE   24     26

In [3]:
emp.loc[1]

Name     JK
Age      19
Marks    21
Name: 1, dtype: object

In [4]:
emp.describe()

             Age      Marks
count   7.000000   7.000000
mean   21.000000  23.000000
std     2.160247   2.160247
min    18.000000  20.000000
25%    19.500000  21.500000
50%    21.000000  23.000000
75%    22.500000  24.500000
max    24.000000  26.000000

In [5]:
emp.shape

(7, 3)

In [6]:
type(emp)

pandas.core.frame.DataFrame

In [7]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Marks   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [8]:
emp.head(3)

  Name  Age  Marks
0    V   18     20
1   JK   19     21
2   JM   20     22

In [9]:
emp.tail(4)

    Name  Age  Marks
3     RM   21     23
4   SUGA   22     24
5    JIN   23     25
6  JHOPE   24     26

In [10]:
emp

    Name  Age  Marks
0      V   18     20
1     JK   19     21
2     JM   20     22
3     RM   21     23
4   SUGA   22     24
5    JIN   23     25
6  JHOPE   24     26

In [11]:
emp["Age"]

0    18
1    19
2    20
3    21
4    22
5    23
6    24
Name: Age, dtype: int64

In [12]:
emp[["Age","Marks"]]

   Age  Marks
0   18     20
1   19     21
2   20     22
3   21     23
4   22     24
5   23     25
6   24     26

In [13]:
emp["Age"].max()

24

In [14]:
emp["Age"].min()

18

In [15]:
emp["Age"].sum()

147

In [16]:
emp["Age"]<30

0    True
1    True
2    True
3    True
4    True
5    True
6    True
Name: Age, dtype: bool

In [17]:
emp[emp["Age"]<20]

  Name  Age  Marks
0    V   18     20
1   JK   19     21

In [17]:
print(emp.loc[2])

Name     JM
Age      20
Marks    22
Name: 2, dtype: object

In [21]:
print(emp.loc[emp["Age"]>23])

    Name  Age  Marks
6  JHOPE   24     26

In [19]:
emp['salary']=[1200,3000,3400,5000,6000,4000,2000]

In [20]:
emp

    Name  Age  Marks  salary
0      V   18     20    1200
1     JK   19     21    3000
2     JM   20     22    3400
3     RM   21     23    5000
4   SUGA   22     24    6000
5    JIN   23     25    4000
6  JHOPE   24     26    2000

In [22]:
emp.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [21]:
emp["address"]=0

In [23]:
emp[["Name","Age"]].head(2)

  Name  Age
0    V   18
1   JK   19

In [25]:
emp[1:2]

  Name  Age  Marks
1   JK   19     21

In [26]:
emp.loc[1:3]

  Name  Age  Marks
1   JK   19     21
2   JM   20     22
3   RM   21     23

In [22]:
emp

    Name  Age  Marks  salary  address
0      V   18     20    1200        0
1     JK   19     21    3000        0
2     JM   20     22    3400        0
3     RM   21     23    5000        0
4   SUGA   22     24    6000        0
5    JIN   23     25    4000        0
6  JHOPE   24     26    2000        0

In [27]:
for index,rows in emp.iterrows():
    print(index,rows)

0 Name      V
Age      18
Marks    20
Name: 0, dtype: object
1 Name     JK
Age      19
Marks    21
Name: 1, dtype: object
2 Name     JM
Age      20
Marks    22
Name: 2, dtype: object
3 Name     RM
Age      21
Marks    23
Name: 3, dtype: object
4 Name     SUGA
Age        22
Marks      24
Name: 4, dtype: object
5 Name     JIN
Age       23
Marks     25
Name: 5, dtype: object
6 Name     JHOPE
Age         24
Marks       26
Name: 6, dtype: object

In [30]:
for index,rows in emp.iterrows():
    print(index,rows[["Age","Name"]])

0 Age     18
Name     V
Name: 0, dtype: object
1 Age     19
Name    JK
Name: 1, dtype: object
2 Age     20
Name    JM
Name: 2, dtype: object
3 Age     21
Name    RM
Name: 3, dtype: object
4 Age       22
Name    SUGA
Name: 4, dtype: object
5 Age      23
Name    JIN
Name: 5, dtype: object
6 Age        24
Name    JHOPE
Name: 6, dtype: object

In [23]:
emp.loc[1]

Name         JK
Age          19
Marks        21
salary     3000
address       0
Name: 1, dtype: object

In [34]:
emp.index=[1,2,3,4,5,6,7]
emp

    Name  Age  Marks
1      V   18     20
2     JK   19     21
3     JM   20     22
4     RM   21     23
5   SUGA   22     24
6    JIN   23     25
7  JHOPE   24     26

In [24]:
emp.loc[1,"Name"]

'JK'

In [35]:
emp.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [25]:
newemp=emp[(emp.Age>20)&(emp.Marks>20)]

In [26]:
newemp

    Name  Age  Marks  salary  address
3     RM   21     23    5000        0
4   SUGA   22     24    6000        0
5    JIN   23     25    4000        0
6  JHOPE   24     26    2000        0

In [27]:
newemp["Name"]

3       RM
4     SUGA
5      JIN
6    JHOPE
Name: Name, dtype: object

In [36]:
emp.rename(columns={"Age":"Years"})

    Name  Years  Marks
1      V     18     20
2     JK     19     21
3     JM     20     22
4     RM     21     23
5   SUGA     22     24
6    JIN     23     25
7  JHOPE     24     26

In [38]:
emp.iloc[1]

Name     JK
Age      19
Marks    21
Name: 2, dtype: object

In [39]:
emp.drop([7])

   Name  Age  Marks
1     V   18     20
2    JK   19     21
3    JM   20     22
4    RM   21     23
5  SUGA   22     24
6   JIN   23     25

In [41]:
emp.size

21

In [42]:
emp.sort_values("Name")

    Name  Age  Marks
7  JHOPE   24     26
6    JIN   23     25
2     JK   19     21
3     JM   20     22
4     RM   21     23
5   SUGA   22     24
1      V   18     20

In [43]:
emp.sort_values("Name",ascending=False)

    Name  Age  Marks
1      V   18     20
5   SUGA   22     24
4     RM   21     23
3     JM   20     22
2     JK   19     21
6    JIN   23     25
7  JHOPE   24     26

In [44]:
emp.drop(columns="Marks")

    Name  Age
1      V   18
2     JK   19
3     JM   20
4     RM   21
5   SUGA   22
6    JIN   23
7  JHOPE   24

In [48]:
emp.iloc[-1]

Name     JHOPE
Age         24
Marks       26
Name: 7, dtype: object

In [49]:
emp.size

21

In [50]:
emp.count()

Name     7
Age      7
Marks    7
dtype: int64

<bound method DataFrame.sort_values of     Name  Age  Marks
1      V   18     20
2     JK   19     21
3     JM   20     22
4     RM   21     23
5   SUGA   22     24
6    JIN   23     25
7  JHOPE   24     26>